<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/16_Avg_2024_home_work.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
# Set-up
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
import pandas as pd
import numpy as np
from sklearn.metrics import *
from sklearn.model_selection import *
from sklearn.linear_model import *
from sklearn.datasets import *

In [10]:
# Load the California Housing dataset and save it as CSV
california_housing = fetch_california_housing(as_frame=True)
df = california_housing.frame
df.to_csv('Dataset.csv', index=False)

# Open and load the CSV into a pandas DataFrame
with open('Dataset.csv') as f:
    california = pd.read_csv(f, encoding='unicode_escape')

# Drop the table if it exists, then persist the DataFrame to the SQL database
%sql DROP TABLE IF EXISTS california;
%sql --persist california

 * sqlite://
Done.
 * sqlite://

'Persisted california'

In [11]:
%%sql SELECT * FROM california LIMIT 5

 * sqlite://
Done.

[(0, 8.3252, 41.0, 6.984126984126984, 1.0238095238095235, 322.0, 2.555555555555556, 37.88, -122.23, 4.526),
 (1, 8.3014, 21.0, 6.238137082601054, 0.9718804920913884, 2401.0, 2.109841827768014, 37.86, -122.22, 3.585),
 (2, 7.2574, 52.0, 8.288135593220339, 1.073446327683616, 496.0, 2.8022598870056497, 37.85, -122.24, 3.521),
 (3, 5.6431, 52.0, 5.817351598173516, 1.0730593607305936, 558.0, 2.547945205479452, 37.85, -122.25, 3.413),
 (4, 3.8462, 52.0, 6.281853281853282, 1.0810810810810811, 565.0, 2.1814671814671813, 37.85, -122.25, 3.422)]

In [12]:
%%sql SELECT * FROM
california LIMIT 5;

 * sqlite://
Done.

[(0, 8.3252, 41.0, 6.984126984126984, 1.0238095238095235, 322.0, 2.555555555555556, 37.88, -122.23, 4.526),
 (1, 8.3014, 21.0, 6.238137082601054, 0.9718804920913884, 2401.0, 2.109841827768014, 37.86, -122.22, 3.585),
 (2, 7.2574, 52.0, 8.288135593220339, 1.073446327683616, 496.0, 2.8022598870056497, 37.85, -122.24, 3.521),
 (3, 5.6431, 52.0, 5.817351598173516, 1.0730593607305936, 558.0, 2.547945205479452, 37.85, -122.25, 3.413),
 (4, 3.8462, 52.0, 6.281853281853282, 1.0810810810810811, 565.0, 2.1814671814671813, 37.85, -122.25, 3.422)]

In [13]:
%%sql SELECT `HouseAge`, `index`, `Latitude`, `Longitude`  FROM
`california` LIMIT 5;

 * sqlite://
Done.

[(41.0, 0, 37.88, -122.23),
 (21.0, 1, 37.86, -122.22),
 (52.0, 2, 37.85, -122.24),
 (52.0, 3, 37.85, -122.25),
 (52.0, 4, 37.85, -122.25)]

In [14]:
# Read datasets from CSV files
films = pd.read_csv('films.csv', header=None)
films = films.rename(columns={0: 'id',
                              1: 'title',
                              2: 'releas_date',
                              3: 'country',
                              4: 'duratioon',
                              5: 'language',
                              6: 'certificatipon',
                              7: 'gross',
                              8: 'budget'})
reviews = pd.read_csv('reviews.csv', header=None)
reviews = reviews.rename(columns={0: 'id',
                                  1: 'film_id',
                                  2: 'num_user',
                                  3: 'num_critic',
                                  4: 'imdb_score',
                                  5: 'num_votes',
                                  6: 'facebook_likes'})
people = pd.read_csv('people.csv', header=None)
people = people.rename(columns={0: 'id',
                                1: 'name',
                                2: 'birthdate',
                                3: 'deathdate'})
roles = pd.read_csv('roles.csv', header=None)
roles = roles.rename(columns={0: 'id',
                              1: 'film_id',
                              2: 'person_id',
                              3: 'role'})

# Drop tables if they exist, then persist the DataFrames to the SQL database
%sql DROP TABLE IF EXISTS films;
%sql --persist films

%sql DROP TABLE IF EXISTS reviews;
%sql --persist reviews

%sql DROP TABLE IF EXISTS people;
%sql --persist people

%sql DROP TABLE IF EXISTS roles;
%sql --persist roles

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted roles'

In [27]:
%%sql SELECT *
FROM films
LIMIT 2;

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0),
 (1, 2, 'Over the Hill to the Poorhouse', 1920.0, 'USA', 110.0, None, None, 3000000.0, 100000.0)]

In [28]:
%%sql SELECT *
FROM reviews
LIMIT 2;

 * sqlite://
Done.

[(0, 3934, 588.0, 432.0, 7.0999999, 203461, 46000),
 (1, 3405, 285.0, 267.0, 6.4000001, 149998, 0)]

In [75]:
%%sql SELECT *
FROM people
LIMIT 2;

 * sqlite://
Done.

[(0, 1, '50 Cent', '1975-07-06', None),
 (1, 2, 'A. Michael Baldwin', '1963-04-04', None)]

In [30]:
%%sql SELECT *
FROM roles LIMIT 2;

 * sqlite://
Done.

[(0, 1, 1, 1630, 'director'), (1, 2, 1, 4843, 'actor')]

In [31]:
%%sql SELECT *
FROM films AS fm
INNER JOIN reviews AS rv
on fm.id = rv.film_id
INNER JOIN roles AS rl
on fm.id = rl.film_id
INNER JOIN people AS ps
on rl.person_id = ps.id
LIMIT 2;

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0, 63, 3016, 1.0, 5.0, 7.4000001, 59, 18, 0, 1, 1, 1630, 'director', 1629, 1630, 'D.W. Griffith', '1875-01-22', '1948-07-23'),
 (0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0, 63, 3016, 1.0, 5.0, 7.4000001, 59, 18, 1, 2, 1, 4843, 'actor', 4842, 4843, 'Lillian Gish', '1893-10-14', '1993-02-27')]

In [32]:
%%sql SELECT COUNT(*) FROM people;

 * sqlite://
Done.

[(8397,)]

In [33]:
%%sql SELECT COUNT(DISTINCT birthdate)
FROM people;

 * sqlite://
Done.

[(5398,)]

In [26]:
%%sql SELECT * FROM films
WHERE releas_date BETWEEN '1960.0' AND '1970.0'
LIMIT 5;

 * sqlite://
Done.

[(74, 75, 'Elmer Gantry', 1960.0, 'USA', 146.0, 'English', 'Approved', None, 3000000.0),
 (75, 76, 'Psycho', 1960.0, 'USA', 108.0, 'English', 'R', 32000000.0, 806947.0),
 (76, 77, 'The Apartment', 1960.0, 'USA', 125.0, 'English', 'Approved', None, 3000000.0),
 (77, 78, 'Judgment at Nuremberg', 1961.0, 'USA', 186.0, 'English', 'Not Rated', None, 3000000.0),
 (78, 79, 'Pocketful of Miracles', 1961.0, 'USA', 136.0, 'English', 'Approved', None, 2900000.0)]

In [35]:
%%sql SELECT *
FROM films
WHERE releas_date = '1960.0';

 * sqlite://
Done.

[(74, 75, 'Elmer Gantry', 1960.0, 'USA', 146.0, 'English', 'Approved', None, 3000000.0),
 (75, 76, 'Psycho', 1960.0, 'USA', 108.0, 'English', 'R', 32000000.0, 806947.0),
 (76, 77, 'The Apartment', 1960.0, 'USA', 125.0, 'English', 'Approved', None, 3000000.0)]

In [42]:
%%sql SELECT * FROM people
LIMIT 5;

 * sqlite://
Done.

[(0, 1, '50 Cent', '1975-07-06', None),
 (1, 2, 'A. Michael Baldwin', '1963-04-04', None),
 (2, 3, 'A. Raven Cruz', None, None),
 (3, 4, 'A.J. Buckley', '1978-02-09', None),
 (4, 5, 'A.J. DeLucia', None, None)]

In [40]:
%%sql SELECT *
FROM films
LIMIT 1;

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0)]

In [43]:
%%sql SELECT *
FROM roles
LIMIT 1;

 * sqlite://
Done.

[(0, 1, 1, 1630, 'director')]

In [45]:
%%sql SELECT *
FROM reviews
LIMIT 1;

 * sqlite://
Done.

[(0, 3934, 588.0, 432.0, 7.0999999, 203461, 46000)]

### Eng kup filmlar chiqqan yil

In [53]:
%%sql SELECT releas_date, COUNT(*) as film_count
FROM films
GROUP BY releas_date
ORDER BY film_count DESC
LIMIT 1;

 * sqlite://
Done.

[(2009.0, 260)]

Eng kup kino chiqargan top 5 davlat

In [65]:
%%sql SELECT country, COUNT(*) as film_count
FROM films
GROUP BY country
ORDER BY film_count DESC
LIMIT 5;

 * sqlite://
Done.

[('USA', 3750), ('UK', 443), ('France', 153), ('Canada', 123), ('Germany', 97)]

Eng kup budejtga ega top 5 film

In [66]:
%%sql SELECT *
FROM films
ORDER BY budget DESC
LIMIT 5;

 * sqlite://
Done.

[(2703, 2704, 'The Host', 2006.0, 'South Korea', 110.0, 'Korean', 'R', 2201412.0, 12215500000.0),
 (2376, 2377, 'Lady Vengeance', 2005.0, 'South Korea', 112.0, 'Korean', 'R', 211667.0, 4200000000.0),
 (2336, 2337, 'Fateless', 2005.0, 'Hungary', 134.0, 'Hungarian', 'R', 195888.0, 2500000000.0),
 (985, 986, 'Princess Mononoke', 1997.0, 'Japan', 134.0, 'Japanese', 'PG-13', 2298191.0, 2400000000.0),
 (2222, 2223, 'Steamboy', 2004.0, 'Japan', 103.0, 'Japanese', 'PG-13', 410388.0, 2127519898.0)]

Kinolarda eng kup qatnashgan aktyor

In [67]:
%%sql SELECT ps.name, COUNT(*) as role_count
FROM people AS ps
INNER JOIN roles AS rl
ON ps.id = rl.person_id
WHERE rl.role = 'actor'
GROUP BY ps.name
ORDER BY role_count DESC
LIMIT 5;

 * sqlite://
Done.

[('Robert De Niro', 54),
 ('Morgan Freeman', 47),
 ('Johnny Depp', 41),
 ('Bruce Willis', 40),
 ('Matt Damon', 38)]

Eng kup bal yig'a olgan top 5 filmlar

In [68]:
%%sql SELECT fm.title, rv.imdb_score
FROM films AS fm
INNER JOIN reviews AS rv
ON fm.id = rv.film_id
ORDER BY rv.imdb_score DESC
LIMIT 5;

 * sqlite://
Done.

[('Bending Steel', 1689764),
 ('Freeheld', 1676169),
 ('Finishing the Game: The Search for a New Bruce Lee', 1468200),
 ('Bolt', 1347461),
 ('Peace, Propaganda & the Promised Land', 1324680)]

Har bir davlat uchun eng top filmlari

In [72]:
%%sql SELECT fm.country, fm.title, rv.imdb_score
FROM films AS fm
INNER JOIN reviews AS rv
ON fm.id = rv.film_id
WHERE rv.imdb_score = (
    SELECT MAX(rv_inner.imdb_score)
    FROM reviews AS rv_inner
    INNER JOIN films AS fm_inner ON fm_inner.id = rv_inner.film_id
    WHERE fm_inner.country = fm.country
)
GROUP BY fm.country, fm.title, rv.imdb_score;

 * sqlite://
Done.

[('Afghanistan', 'Osama', 254111),
 ('Argentina', 'Nine Queens', 782437),
 ('Australia', 'Babe', 514125),
 ('Brazil', 'Gabriela', 175196),
 ('Canada', 'Class of 1984', 258186),
 ('China', 'A Woman, a Gun and a Noodle Shop', 1215718),
 ('Denmark', 'Ordet', 63625),
 ('France', 'Joyeux Noel', 982637),
 ('Germany', 'Run Lola Run', 563827),
 ('Hong Kong', 'The Legend of Drunken Master', 306336),
 ('India', 'Hum To Mohabbat Karega', 1251222),
 ('Iran', 'Caravans', 131831),
 ('Italy', 'Once Upon a Time in America', 266636),
 ('Japan', 'Princess Mononoke', 277172),
 ('Libya', 'Lion of the Desert', 115687),
 ('Netherlands', 'Character', 512749),
 ('New Zealand', 'Whale Rider', 383071),
 ('South Korea', 'Inchon', 128285),
 ('Soviet Union', 'Solaris', 106790),
 ('Sweden', 'Cries & Whispers', 156898),
 ('UK', 'The History Boys', 1144337),
 ('USA', 'Bending Steel', 1689764),
 ('West Germany', 'The NeverEnding Story', 189249)]

Qaysi davlatlar film uchun qancha budjet sarflaydi urtacha

In [74]:
%%sql SELECT country, AVG(budget) as total_budget
FROM films
GROUP BY country
ORDER BY total_budget DESC;

 * sqlite://
Done.

[('South Korea', 1383960000.0),
 ('Hungary', 1260000000.0),
 ('Japan', 368416836.7368421),
 ('Thailand', 227250000.0),
 ('India', 97973355.15789473),
 ('New Line', 90000000.0),
 ('New Zealand', 81526923.07692307),
 ('China', 62219000.0),
 ('Czech Republic', 48816666.666666664),
 ('Peru', 45000000.0),
 ('Spain', 42816666.666666664),
 ('USA', 35922721.93055159),
 ('Libya', 35000000.0),
 ('Aruba', 35000000.0),
 ('Germany', 33389000.0),
 ('Australia', 31172110.46),
 ('France', 30672034.615384616),
 ('UK', 27666066.298153035),
 ('Chile', 26000000.0),
 ('Hong Kong', 24873333.333333332),
 ('Belgium', 24500000.0),
 ('West Germany', 20500000.0),
 ('Panama', 20000000.0),
 ('Georgia', 20000000.0),
 ('Norway', 19014285.714285713),
 ('Greece', 18000000.0),
 ('Russia', 17270000.0),
 ('Sweden', 16800000.0),
 ('South Africa', 15750000.0),
 ('Taiwan', 15000000.0),
 ('Canada', 14798458.71559633),
 ('Denmark', 13922222.222222222),
 ('Italy', 13067500.0),
 ('Ireland', 12398750.0),
 ('Switzerland', 11666666.666666666),
 ('Netherlands', 10010000.0),
 ('Turkey', 8300000.0),
 ('Nigeria', 7500000.0),
 ('Bulgaria', 7000000.0),
 ('Iceland', 6900000.0),
 ('Mexico', 5508483.928571428),
 ('Bahamas', 5000000.0),
 ('Romania', 4439500.0),
 ('Brazil', 4171428.5714285714),
 ('Finland', 3850000.0),
 ('Iran', 3672500.0),
 (None, 3500000.0),
 ('Colombia', 3000000.0),
 ('Poland', 2400000.0),
 ('Egypt', 1500000.0),
 ('Argentina', 1425000.0),
 ('Kyrgyzstan', 1400000.0),
 ('Israel', 1150000.0),
 ('Indonesia', 1100000.0),
 ('Soviet Union', 1000000.0),
 ('Pakistan', 1000000.0),
 ('Slovenia', 500000.0),
 ('Dominican Republic', 500000.0),
 ('United Arab Emirates', 125000.0),
 ('Afghanistan', 46000.0),
 ('Kenya', 15000.0),
 ('Philippines', 7000.0),
 ('Slovakia', None),
 ('Cameroon', None),
 ('Cambodia', None)]

Kinolari imdbda yaxshi bal yig'a olgan top 5 ta aktyor

In [79]:
%%sql SELECT ps.name, AVG(rv.imdb_score) AS avg_imdb_score
FROM people AS ps
INNER JOIN roles AS rl
ON ps.id = rl.person_id
INNER JOIN reviews AS rv
ON rl.film_id = rv.film_id
GROUP BY ps.name
ORDER BY avg_imdb_score DESC
LIMIT 5;

 * sqlite://
Done.

[('Dave Carroll', 1689764.0),
 ("Chris 'Wonder' Schoeck", 1689764.0),
 ('Steve Carell', 1676169.0),
 ('Peter Sollett', 1676169.0),
 ('Luke Grimes', 1676169.0)]

Top 5 eng kup daromad keltirgan filmlar

In [80]:
%%sql SELECT fm.title, fm.gross
FROM films AS fm
ORDER BY fm.gross DESC
LIMIT 5;

 * sqlite://
Done.

[('Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('Avatar', 760505847.0),
 ('Titanic', 658672302.0),
 ('Jurassic World', 652177271.0),
 ('The Avengers', 623279547.0)]

Enh kup daromad keltirgan filmlarda uynagan top aktyorlar

In [83]:
%%sql SELECT ps.name, fm.title, fm.gross
FROM people AS ps
INNER JOIN roles AS rl
ON ps.id = rl.person_id
INNER JOIN films AS fm
ON rl.film_id = fm.id
ORDER BY fm.gross DESC
LIMIT 5;

 * sqlite://
Done.

[('Daisy Ridley', 'Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('J.J. Abrams', 'Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('John Boyega', 'Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('Oscar Isaac', 'Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('CCH Pounder', 'Avatar', 760505847.0)]

har bir davlat uchun eng kup daromad keltira olgan kino

In [84]:
%%sql SELECT fm.country, fm.title, fm.gross
FROM films AS fm
WHERE fm.gross = (
    SELECT MAX(fm_inner.gross)
    FROM films AS fm_inner
    WHERE fm_inner.country = fm.country
)

 * sqlite://
Done.

[('West Germany', 'Das Boot', 11433134.0),
 ('Peru', 'The Specialist', 57362581.0),
 ('Aruba', 'Knock Off', 10076136.0),
 ('Czech Republic', 'Ravenous', 2060953.0),
 ('Germany', 'Stuart Little', 140015224.0),
 ('Italy', 'Tea with Mussolini', 14348123.0),
 ('Taiwan', 'Crouching Tiger, Hidden Dragon', 128067808.0),
 ('Denmark', 'Dancer in the Dark', 4157491.0),
 ('India', 'Monsoon Wedding', 13876974.0),
 ('New Zealand', 'The Lord of the Rings: The Fellowship of the Ring', 313837577.0),
 ('New Line', 'Town & Country', 6712451.0),
 ('Brazil', 'City of God', 7563397.0),
 ('Afghanistan', 'Osama', 1127331.0),
 ('Colombia', 'Maria Full of Grace', 6517198.0),
 ('Romania', 'Seed of Chucky', 17016190.0),
 ('Philippines', 'Cavite', 70071.0),
 ('Cameroon', 'Sisters in Law', 32631.0),
 ('Thailand', 'The Protector', 11905519.0),
 ('Netherlands', 'Black Book', 4398392.0),
 ('Canada', 'X-Men: The Last Stand', 234360014.0),
 ('South Korea', 'Dragon Wars: D-War', 10956379.0),
 ('Hong Kong', 'TMNT', 54132596.0),
 ('France', 'Taken', 145000989.0),
 ('South Africa', 'District 9', 115646235.0),
 ('Iceland', 'The Good Heart', 19959.0),
 ('Argentina', 'The Secret in Their Eyes', 20167424.0),
 ('Sweden', 'Easy Money', 188870.0),
 ('Georgia', '5 Days of War', 17149.0),
 ('Iran', 'A Separation', 7098492.0),
 ('Ireland', 'Haywire', 18934858.0),
 ('Norway', 'Headhunters', 1196752.0),
 ('Finland', 'Le Havre', 611709.0),
 ('Spain', 'Midnight in Paris', 56816662.0),
 ('Hungary', 'Monte Carlo', 23179303.0),
 ('Belgium', "The Devil's Double", 1357042.0),
 ('Indonesia', 'The Raid: Redemption', 4105123.0),
 ('Israel', 'The Gatekeepers', 2408553.0),
 ('Poland', 'Ida', 3826455.0),
 ('Mexico', 'Instructions Not Included', 44456509.0),
 ('Russia', 'Machete Kills', 7268659.0),
 ('Australia', 'The Lego Movie', 257756197.0),
 ('China', 'Mission: Impossible - Rogue Nation', 195000874.0),
 ('USA', 'Star Wars: Episode VII - The Force Awakens', 936627416.0),
 ('Chile', 'The 33', 12188642.0),
 ('Greece', 'Midnight Special', 3707794.0),
 ('UK', 'The Jungle Book', 362645141.0),
 ('UK', 'The Jungle Book', 362645141.0),
 ('Japan', 'The Secret Life of Pets', 323505540.0)]